# Student Data
This notebook analyzes pass/fail data for a class

In [ ]:
import numpy as np

data = [50,50,47,97,49,3]
grades = np.array(data)
study_hours = [10.0, 11.5, 9.0, 16.0, 9.25, 1.0]
student_data = np.array([study_hours, grades])
student_data[0][0]

10.0

In [7]:
import pandas as pd

df_students = pd.DataFrame({'Name': ['Dan', 'Joann', 'Pedro','Rosie', 'Ethan', 'Vicky'], 
                            'StudyHours': student_data[0],
                            'Grade': student_data[1]})

df_students

    Name  StudyHours  Grade
0    Dan       10.00   50.0
1  Joann       11.50   50.0
2  Pedro        9.00   47.0
3  Rosie       16.00   97.0
4  Ethan        9.25   49.0
5  Vicky        1.00    3.0

In [8]:
df_students.loc[0]

Name           Dan
StudyHours    10.0
Grade         50.0
Name: 0, dtype: object

In [9]:
df_students.loc[5, 'Grade']

3.0

In [10]:
df_students[df_students['Name'] == 'Vicky']

    Name  StudyHours  Grade
5  Vicky         1.0    3.0

In [11]:
df_students.query('Name=="Vicky"')

    Name  StudyHours  Grade
5  Vicky         1.0    3.0

In [12]:
df_students[df_students.Name=="Vicky"]

    Name  StudyHours  Grade
5  Vicky         1.0    3.0